using System;
using System.Collections.Generic;
using System.Text;

namespace MonoTest
{
    enum RecipeType
    {
        丸太,
        木材,
        木炭,
        岩,
        砂,
        ガラス,
        鉄鉱石,
        銅鉱石,
        金鉱石,
        ミスリル鉱石,
        アダマンタイト,
        オリハルコン,
        鉄,
        銅,
        金,
        ミスリル,
        鋼,
        超合金,

        水,
        魚,
        マンドラゴラ,
        野菜,
        果物,
        血,
        毛皮,
        卵,
        肉,

        焼き魚,
        野菜ジュース,
        フルーツジャム,
        マンドラ粉,
        マンドラ薬,
        紙,
        布,
        ロープ,
        血の結晶,

        歯車,
        鉄の棒,
        ネジ,
        精密歯車,
        黄金歯車,
        魔法回路,
        応用回路,
        発展回路,
        錬金回路,

        クッキー,
        チョコレート,
        ケーキ,
        プリン,
        ハンバーガー,
        ロールケーキ,
        ステーキ,
        カレー,
        賢者の飯,

        職人の槌,
        錬金の槌,
        フライパン,
        鍋,
        スコップ,
        農場,
        つるはし,
        鉱山,
        石の炉,
        鋼の炉,
        ブーメラン,
        ライフル,
        牧場,
        斧,
        バケツ,
        船,
        使い魔,
        街,
        なし,
        COUNT
    }

    enum RelicType
    {
        金レシピ,//製造効率＋
        時の石,//設備引き継ぎ率上昇
        勝利の鍵,//宝箱出現率＋
        召喚の札,//レア敵出現率上昇
        封印のツボ,//敵弱体化
    }
}
